package com.Dima;

import javax.swing.*;
import java.awt.*;

public class aboutProgramm extends JFrame {
    public aboutProgramm(){
        setResizable(false);
        setSize(800,600);
        setDefaultCloseOperation(JFrame.DISPOSE_ON_CLOSE);
        setTitle("О Программе");
        setLocationRelativeTo(null);
        setLayout(new GridLayout(1,1));
        JTextArea info = new JTextArea("""
                ________#####___я знаю__________##_______
                ___________что ты делал _______####______
                _________прошлым летом!!________##_______
                _____________________________######_____
                ____________________________#######_____
                ____####__________________#########___
                ___######________________###_######___
                #########_______________###__######__
                _#######_______________###___######___
                _______#################____######__
                _______##########################__
                ________################____#####____
                _________##___________##_____####______
                _________##___________##_____#########___
                _______###__________###______#########__""");
        add(info);
        setVisible(true);
    }
}
